#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.1`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2024-12-13T10:02:15Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/f8afe4e0-12eb-4540-b868-8503aa3f9d09][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/ada3a270-8956-9949-032e-271a5cc85d4c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 1s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/6515f01e-b05b-c770-e028-7f4cf373f7a1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/8e9eed09-2972-f758-03d7-27163570d37f][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/3ddae7fc-a3e9-64e1-d30f-906ddfcec999][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/25e0941a-5fa7-cf7a-1e7d-802808d49ca8][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/c41824ae-9113-2903-71ea-46d8ac8f8085][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:57:48Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/d2af0085-ce63-24fc-c633-f661562e52df][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T11:54:36Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:58:37Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:58:00Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=000B5CB921AD009C][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=001970E29327CBAB][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=0001F859D641DF75][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=3800484621856956/f8afe4e0-12eb-4540-b868-8503aa3f9d09][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=492104396272220/f8afe4e0-12eb-4540-b868-8503aa3f9d09][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|914c0423-ffc0-4b91-86c5-ed073acbe1e8][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:58:39Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/a765f8e5-7482-242a-8455-3407be79bd72][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/7bd0ab8f-025d-8e48-8f8c-4fa744fa426f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/af56bf80-287a-7fad-f9cb-f2398ed327aa][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/f2e90b37-38a1-6389-f384-614b06368d08][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/51227a6d-f7bb-e756-63d1-f69a7f2bfae5][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:57:51Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/2c4af69d-b829-ab29-2a6e-d054de887b19][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/28652eea-2e9c-bf5f-16d1-bd8dbe2c7b4f][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:57:49Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/02c81f42-94cc-e055-cd21-f5bfc172120b][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/7da0b351-a6be-481b-8c88-f7b7a19681a9][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/9ad35481-d07e-47a5-b3a7-c422ed51c1ab][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/9994a7e7-43b0-462e-870b-dda69c940ddb][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/8a66b243-a227-43ca-8c8c-046f7f7b279a][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/adc6c2ec-cab9-407c-88e0-c49a78c285db][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/cf9fca71-5eda-4e7d-a8bc-fffa2340971e][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/aca30ddc-da65-421f-8633-b8a926705393][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/9f135699-ca98-4091-a234-28da256596a5][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/2c370d51-d2ab-4938-b23c-db1b40dd6968][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=f8afe4e0-12eb-4540-b868-8503aa3f9d09/25ff8959-edc1-434d-bcde-fc5a279ea157][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/8f634703-847b-4a01-bcec-d93dc1b57ef0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/b6c1a101-ee36-8a2b-072e-5823d2e5cbf5][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2024-12-03T10:58:37Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=7798173579334247281][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=7724436373171513004][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=1770648528531565818][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=5927309468020936927][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=68140758642572664][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=1383430315960408748][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=7831561721262485936][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=8438859677871457269][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=1289019625985135492][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=6822270788694824077][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_storage_credential.storage_credential: Refreshing state... [id=mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_external: Refreshing state... [id=mydlz01-dptest-int-ext][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_workspace: Refreshing state... [id=mydlz01-dptest-int-wks][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_raw: Refreshing state... [id=mydlz01-dptest-int-raw][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_curated: Refreshing state... [id=mydlz01-dptest-int-cur][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_enriched: Refreshing state... [id=mydlz01-dptest-int-enr][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_internal: Refreshing state... [id=mydlz01-dptest-int-int][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_external: Refreshing state... [id=mydlz01-dptest-int][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_ip_access_list.ip_access_list_allow[0m will be created
[0m  [32m+[0m[0m resource "databricks_ip_access_list" "ip_access_list_allow" {
      [32m+[0m[0m enabled      = true
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_addresses = []
      [32m+[0m[0m label        = "allow-list"
      [32m+[0m[0m list_type    = "ALLOW"
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["access"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "access"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["billing"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "billing"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["compute"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "compute"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["lakeflow"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "lakeflow"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["marketplace"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "marketplace"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["query"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "query"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["serving"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "serving"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["storage"][0m will be created
[0m  [32m+[0m[0m resource "databricks_system_schema" "system_schema" {
      [32m+[0m[0m full_name    = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m schema       = "storage"
      [32m+[0m[0m state        = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"][0m will be updated in-place
[0m  [33m~[0m[0m resource "databricks_cluster_policy" "cluster_policy" {
      [33m~[0m[0m definition            = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m dbus_per_hour                                 = {
                  [33m~[0m[0m maxValue = 100 [33m->[0m[0m 10
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
                [90m# (17 unchanged attributes hidden)[0m[0m
            }
        )
        id                    = "0001F859D641DF75"
        name                  = "PersonalComputePolicyPtt"
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 9 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>